* cleanup
** Current status
#+begin_src bash :results verbatim
docker images
docker ps -a
#+end_src

#+RESULTS:
#+begin_example
REPOSITORY                       TAG                 IMAGE ID            CREATED             SIZE
kafkadocker_kafka                latest              a6591a820112        2 days ago          784.2 MB
raghavgautam/emacs25             latest              d2d1574aad8b        11 days ago         601 MB
ubuntu                           14.04               f2d8ce9fa988        2 weeks ago         187.9 MB
anapsix/alpine-java              latest              78742b25ddf7        3 weeks ago         123.8 MB
centos                           latest              980e0e4c79ec        5 weeks ago         196.8 MB
ubuntu                           latest              bd3d4369aebc        7 weeks ago         126.6 MB
dorowu/ubuntu-desktop-lxde-vnc   latest              1a2bf0a7544a        11 weeks ago        1.248 GB
hello-world                      latest              c54a2cc56cbb        3 months ago        1.848 kB
wurstmeister/zookeeper           latest              dc00f1198a44        9 months ago        468.8 MB
CONTAINER ID        IMAGE                    COMMAND                  CREATED             STATUS              PORTS                                                NAMES
7d02c4d9d060        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32813->22/tcp, 0.0.0.0:32812->9092/tcp       kafkadocker_kafka_9
1bde4e395c49        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32815->22/tcp, 0.0.0.0:32814->9092/tcp       kafkadocker_kafka_10
a6ddab5afac0        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32807->22/tcp, 0.0.0.0:32806->9092/tcp       kafkadocker_kafka_12
725074cb9f44        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32809->22/tcp, 0.0.0.0:32808->9092/tcp       kafkadocker_kafka_7
30910dd9099c        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32805->22/tcp, 0.0.0.0:32804->9092/tcp       kafkadocker_kafka_4
be87977980ab        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32811->22/tcp, 0.0.0.0:32810->9092/tcp       kafkadocker_kafka_3
888d9d7ed92a        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32803->22/tcp, 0.0.0.0:32802->9092/tcp       kafkadocker_kafka_6
6d16af394981        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32801->22/tcp, 0.0.0.0:32800->9092/tcp       kafkadocker_kafka_11
c0faba9045e8        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32799->22/tcp, 0.0.0.0:32798->9092/tcp       kafkadocker_kafka_8
79aa2c0cf1dc        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32797->22/tcp, 0.0.0.0:32796->9092/tcp       kafkadocker_kafka_2
5b2baac4cdac        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32795->22/tcp, 0.0.0.0:32794->9092/tcp       kafkadocker_kafka_5
f1bdec1e011b        wurstmeister/zookeeper   "/bin/sh -c '/usr/sbi"   2 days ago          Up 7 hours          22/tcp, 2888/tcp, 3888/tcp, 0.0.0.0:2181->2181/tcp   kafkadocker_zookeeper_1
e6ec3a325331        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 7 hours          0.0.0.0:32793->22/tcp, 0.0.0.0:32792->9092/tcp       kafkadocker_kafka_1
#+end_example

** Cleanup
#+begin_src bash :results verbatim
docker-compose down
docker rm $(docker ps -a -f status=exited -q)
#+end_src

#+RESULTS:

** Cleanup images
#+begin_src bash :results verbatim
docker rmi kafkadocker_kafka -f
docker rmi $(docker images -f dangling=true -q)
#+end_src

#+RESULTS:
#+begin_example
Deleted: sha256:a6591a820112809255becd413bdd762815cd6b6ae5043990045e715c1a50575f
Deleted: sha256:b39624b56f7203c256ab9ed53015d4e16a54c34935e78e4e7635ae040c610552
Deleted: sha256:3376acb4673a22cd17efba97f42746c06a7709a6c72579635517d9db8ea7607e
Deleted: sha256:db1879e3152f9c70df32e256168be7bc06dd5a62566b29cfd46dd72a993e28be
Deleted: sha256:312d9b5aacb8492f5bb57336b13ffc5ab82b5235a51c3581fc2d0c0402a01222
Deleted: sha256:0cc0fb278ddc6345c5cf532eccb41f5ff69ec04825c83e7f45824443a163a087
Deleted: sha256:f88d837678c6a5503926ef58a5bab2ddf316984fcd7a89666347199d03744265
Deleted: sha256:671f58b18528e5e743e59ce2173c3719017b3053ea68c48cd447b797fd97157d
Deleted: sha256:0555ad2818e3cf32be73ab693bda1704baeba724dd432daa959663e3210a2c81
Deleted: sha256:5950436e8a3e513f8c10c8ff3e159b393e57463406f373d1773441ef4d828d02
Deleted: sha256:fa998d30e47c21c761ffae3029f46890f3e8c5e7e8eddd016c8759d1fbd7a1f3
Deleted: sha256:90f4e84d202a41fd17fffcabb1e76a795dc11e25554977b6d7451bb33eb42bea
Deleted: sha256:98eaeffaf9dfb4c41fb2873d8de7dba7636cfb369fe58f02f36a8602e89b523d
Deleted: sha256:8c913e5287ef9675843fad91431569253b2aac38410d821fbc57366c0a19cc9b
Deleted: sha256:470ff916989372ffcd7f7ff2c3883f6d8a8bea7541f43850ea224def5f352af1
Deleted: sha256:49d01ddca860f611300ad8a743ba80cb31062f43463f0e90ff3878dc7787c479
Deleted: sha256:2cea3c043024d3849635aa5a75ab804d8e619e6ddc10d4f2e71651b61cbc4aa4
Deleted: sha256:9cabf87eb6033c302c89ab5c0e05655efa2ca6e965b6d85f7479e305849132f9
Deleted: sha256:a268596433cfe1accf7aa305527a29e400e896fd794933a84fba1de7c20649e5
Deleted: sha256:534e85a39695554ceb9804b8b26ab61a888de9ec073dbdd53d88615c34a1b073
Deleted: sha256:988010b95be25491e5ce057cd5600a98a33410472c5b2d5f4f94335a7a715f0f
#+end_example

* start cluster
#+begin_src bash :results verbatim
docker-compose down
docker-compose build
docker-compose up -d
#+end_src

#+RESULTS:
#+begin_example
Step 1 : FROM ubuntu
 ---> bd3d4369aebc
Step 2 : MAINTAINER Raghav Kumar Gautam
 ---> Using cache
 ---> 71c68cd6b3fb
Step 3 : RUN apt update
 ---> Using cache
 ---> 1f9076df68dd
Step 4 : RUN apt install -y unzip wget curl jq coreutils openssh-server net-tools vim docker.io openjdk-8-jdk
 ---> Using cache
 ---> 1de584c5475a
Step 5 : RUN apt install -y python-pip
 ---> Using cache
 ---> bdf9b24ab6bb
Step 6 : RUN pip install ducktape
 ---> Using cache
 ---> 9abd9e7b40c6
Step 7 : ENV KAFKA_VERSION "0.10.0.1" SCALA_VERSION "2.11"
 ---> Using cache
 ---> 21c75dcbd7b4
Step 8 : VOLUME /kafka
 ---> Using cache
 ---> c77dad84f5af
Step 9 : ENV KAFKA_HOME /opt/kafka_${SCALA_VERSION}-${KAFKA_VERSION}
 ---> Using cache
 ---> 0a909f9905f1
Step 10 : ADD start-kafka.sh /usr/bin/start-kafka.sh
 ---> Using cache
 ---> 93a58254c376
Step 11 : ADD broker-list.sh /usr/bin/broker-list.sh
 ---> Using cache
 ---> bc2f6c18fc7d
Step 12 : ADD create-topics.sh /usr/bin/create-topics.sh
 ---> Using cache
 ---> 5cd533206e7f
Step 13 : ADD ssh /root/.ssh
 ---> Using cache
 ---> ccb036068767
Step 14 : CMD service ssh start && (tar xfz /kfk_src/core/build/distributions/kafka_2.10-0.10.2.0-SNAPSHOT.tgz -C /opt || echo missing kafka tgz did you build kafka tarball) && mv /opt/kafka* /opt/kafka-trunk && bash
 ---> Using cache
 ---> 0788e8f7663d
Successfully built 0788e8f7663d
#+end_example

* scaling cluster
#+begin_src bash :results verbatim
docker-compose scale kafka=12
#+end_src

#+RESULTS:

#+begin_src bash :results verbatim
docker ps
#+end_src

#+RESULTS:
#+begin_example
CONTAINER ID        IMAGE                    COMMAND                  CREATED             STATUS              PORTS                                                NAMES
cb0cd5cdd5e9        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 27 seconds       0.0.0.0:32839->22/tcp, 0.0.0.0:32838->9092/tcp       kafkadocker_kafka_6
8a312b3907eb        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 26 seconds       0.0.0.0:32833->22/tcp, 0.0.0.0:32832->9092/tcp       kafkadocker_kafka_11
3c862e0d7ce3        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 26 seconds       0.0.0.0:32835->22/tcp, 0.0.0.0:32834->9092/tcp       kafkadocker_kafka_4
04172f5f80b5        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 26 seconds       0.0.0.0:32837->22/tcp, 0.0.0.0:32836->9092/tcp       kafkadocker_kafka_3
b58e9eb79eab        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 27 seconds       0.0.0.0:32831->22/tcp, 0.0.0.0:32830->9092/tcp       kafkadocker_kafka_7
02155da910b9        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 28 seconds       0.0.0.0:32825->22/tcp, 0.0.0.0:32824->9092/tcp       kafkadocker_kafka_9
7896d2e113c8        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 26 seconds       0.0.0.0:32829->22/tcp, 0.0.0.0:32828->9092/tcp       kafkadocker_kafka_10
77692c03255d        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 28 seconds       0.0.0.0:32827->22/tcp, 0.0.0.0:32826->9092/tcp       kafkadocker_kafka_12
f794a783a868        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 28 seconds       0.0.0.0:32823->22/tcp, 0.0.0.0:32822->9092/tcp       kafkadocker_kafka_2
950f3a175eb3        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 29 seconds       0.0.0.0:32821->22/tcp, 0.0.0.0:32820->9092/tcp       kafkadocker_kafka_5
655c6871bcbe        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 29 seconds       0.0.0.0:32819->22/tcp, 0.0.0.0:32818->9092/tcp       kafkadocker_kafka_8
d4f38b519734        kafkadocker_kafka        "/bin/sh -c 'service "   2 days ago          Up 46 seconds       0.0.0.0:32817->22/tcp, 0.0.0.0:32816->9092/tcp       kafkadocker_kafka_1
31f6e0fd4c4f        wurstmeister/zookeeper   "/bin/sh -c '/usr/sbi"   2 days ago          Up 45 seconds       22/tcp, 2888/tcp, 3888/tcp, 0.0.0.0:2181->2181/tcp   kafkadocker_zookeeper_1
#+end_example

* Create topic
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c "/opt/kafka_2.11-0.10.0.1/bin/kafka-topics.sh --create --topic abc --zookeeper kafkadocker_zookeeper_1 --replication-factor 5 --partitions 10"
#+end_src

#+RESULTS:
: Created topic "abc".

* List topics
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c "/opt/kafka_2.11-0.10.0.1/bin/kafka-topics.sh --list --zookeeper kafkadocker_zookeeper_1"
#+end_src

#+RESULTS:
: abc

* describe
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c "/opt/kafka_2.11-0.10.0.1/bin/kafka-topics.sh --list --zookeeper kafkadocker_zookeeper_1"
docker exec kafkadocker_kafka_1 bash -c "/opt/kafka_2.11-0.10.0.1/bin/kafka-topics.sh --describe --topic abc --zookeeper kafkadocker_zookeeper_1"
#+end_src

#+RESULTS:
#+begin_example
abc
Topic:abc	PartitionCount:10	ReplicationFactor:5	Configs:
	Topic: abc	Partition: 0	Leader: 1002	Replicas: 1002,1007,1008,1009,1010	Isr: 1002,1007,1008,1009,1010
	Topic: abc	Partition: 1	Leader: 1003	Replicas: 1003,1008,1009,1010,1011	Isr: 1003,1008,1009,1010,1011
	Topic: abc	Partition: 2	Leader: 1004	Replicas: 1004,1009,1010,1011,1012	Isr: 1004,1009,1010,1011,1012
	Topic: abc	Partition: 3	Leader: 1005	Replicas: 1005,1010,1011,1012,1001	Isr: 1005,1010,1011,1012,1001
	Topic: abc	Partition: 4	Leader: 1006	Replicas: 1006,1011,1012,1001,1002	Isr: 1006,1011,1012,1001,1002
	Topic: abc	Partition: 5	Leader: 1007	Replicas: 1007,1012,1001,1002,1003	Isr: 1007,1012,1001,1002,1003
	Topic: abc	Partition: 6	Leader: 1008	Replicas: 1008,1001,1002,1003,1004	Isr: 1008,1001,1002,1003,1004
	Topic: abc	Partition: 7	Leader: 1009	Replicas: 1009,1002,1003,1004,1005	Isr: 1009,1002,1003,1004,1005
	Topic: abc	Partition: 8	Leader: 1010	Replicas: 1010,1003,1004,1005,1006	Isr: 1010,1003,1004,1005,1006
	Topic: abc	Partition: 9	Leader: 1011	Replicas: 1011,1004,1005,1006,1007	Isr: 1011,1004,1005,1006,1007
#+end_example

* produce
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c 'for i in {1..1000}; do echo abc$i; done | /opt/kafka_2.11-0.10.0.1/bin/kafka-console-producer.sh --topic abc --broker-list `hostname`:9092'
#+end_src

#+RESULTS:

* consume
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c '/opt/kafka_2.11-0.10.0.1/bin/kafka-console-consumer.sh --topic abc --zookeeper kafkadocker_zookeeper_1 --from-beginning --timeout-ms 10000 | head'
#docker exec kafkadocker_kafka_1 bash -c '/opt/kafka_2.11-0.10.0.1/bin/kafka-console-consumer.sh --topic abc --zookeeper kafkadocker_zookeeper_1 --from-beginning --timeout-ms 10000 | wc'
#+end_src

#+RESULTS:
#+begin_example
abc1
abc10
abc100
abc1000
abc101
abc103
abc104
abc105
abc106
abc107
#+end_example

* Running kafka tests
** Generate cluster json file
#+begin_src bash :results verbatim
docker network inspect kafkadocker_default | jq '.[0].Containers | to_entries[] | .value | {"hostname": .Name, "user": "root", "ssh_args": "-i ~/.ssh/id_rsa", "ssh_hostname": "", "externally_routable_ip": ""}' |  jq -s . | jq '.  | {"nodes": .}' > /Users/raghav/work/apache/kafka/tests/cluster_file.json
#+end_src

#+RESULTS:
** Performance services tests 2/5 passed
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c 'cd /kfk_src; ducktape --cluster-file tests/cluster_file.json tests/kafkatest/sanity_checks/test_performance_services.py'
#+end_src

#+begin_src bash :results verbatim
date
docker exec kafkadocker_kafka_1 bash -c 'cd /kfk_src; ducktape --cluster-file tests/cluster_file.json tests/kafkatest/tests/client/consumer_test.py' 2>&1
date
#+end_src

#+RESULTS:
#+begin_example
Mon Oct 17 19:10:45 PDT 2016
[INFO:2016-10-18 01:43:16,916]: SerialTestRunner: starting test run with session id 2016-10-18--001...
[INFO:2016-10-18 01:43:16,918]: SerialTestRunner: running 16 tests...
[INFO:2016-10-18 01:43:16,930]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: test 1 of 16
[INFO:2016-10-18 01:43:16,932]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: setting up
[INFO:2016-10-18 01:43:36,581]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: running
[INFO:2016-10-18 01:44:05,464]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: PASS
[INFO:2016-10-18 01:44:05,468]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: tearing down
[INFO:2016-10-18 01:44:32,464]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: Summary: 
[INFO:2016-10-18 01:44:32,466]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:44:32,484]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: test 2 of 16
[INFO:2016-10-18 01:44:32,486]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: setting up
[INFO:2016-10-18 01:44:53,271]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: running
[INFO:2016-10-18 01:45:21,583]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: PASS
[INFO:2016-10-18 01:45:21,588]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: tearing down
[INFO:2016-10-18 01:45:49,961]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: Summary: 
[INFO:2016-10-18 01:45:49,965]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:45:49,977]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: test 3 of 16
[INFO:2016-10-18 01:45:49,978]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: setting up
[INFO:2016-10-18 01:46:09,916]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: running
[INFO:2016-10-18 01:46:26,923]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: PASS
[INFO:2016-10-18 01:46:26,928]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: tearing down
[INFO:2016-10-18 01:46:53,960]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: Summary: 
[INFO:2016-10-18 01:46:53,964]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:46:53,973]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: test 4 of 16
[INFO:2016-10-18 01:46:53,975]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: setting up
[INFO:2016-10-18 01:47:14,146]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: running
[INFO:2016-10-18 01:47:33,306]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: PASS
[INFO:2016-10-18 01:47:33,309]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: tearing down
[INFO:2016-10-18 01:48:01,981]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: Summary: 
[INFO:2016-10-18 01:48:01,983]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:48:01,994]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: test 5 of 16
[INFO:2016-10-18 01:48:01,996]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: setting up
[INFO:2016-10-18 01:48:22,063]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: running
[INFO:2016-10-18 01:52:25,795]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: PASS
[INFO:2016-10-18 01:52:25,798]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: tearing down
[INFO:2016-10-18 01:53:02,111]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: Summary: 
[INFO:2016-10-18 01:53:02,115]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:53:02,132]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: test 6 of 16
[INFO:2016-10-18 01:53:02,134]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: setting up
[INFO:2016-10-18 01:53:22,512]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: running
[INFO:2016-10-18 01:56:18,890]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: PASS
[INFO:2016-10-18 01:56:18,895]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: tearing down
[INFO:2016-10-18 01:57:04,895]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: Summary: 
[INFO:2016-10-18 01:57:04,897]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:57:04,908]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: test 7 of 16
[INFO:2016-10-18 01:57:04,910]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: setting up
[INFO:2016-10-18 01:57:25,558]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: running
[INFO:2016-10-18 01:58:45,192]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: PASS
[INFO:2016-10-18 01:58:45,195]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: tearing down
[INFO:2016-10-18 01:59:24,497]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: Summary: 
[INFO:2016-10-18 01:59:24,498]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 01:59:24,510]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: test 8 of 16
[INFO:2016-10-18 01:59:24,512]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: setting up
[INFO:2016-10-18 01:59:44,678]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: running
[INFO:2016-10-18 02:01:59,251]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: PASS
[INFO:2016-10-18 02:01:59,254]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: tearing down
[INFO:2016-10-18 02:02:41,796]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: Summary: 
[INFO:2016-10-18 02:02:41,797]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:02:41,807]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: test 9 of 16
[INFO:2016-10-18 02:02:41,809]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: setting up
[INFO:2016-10-18 02:03:02,154]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: running
[INFO:2016-10-18 02:04:36,024]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: PASS
[INFO:2016-10-18 02:04:36,027]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: tearing down
[INFO:2016-10-18 02:05:17,000]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: Summary: 
[INFO:2016-10-18 02:05:17,002]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:05:17,015]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: test 10 of 16
[INFO:2016-10-18 02:05:17,018]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: setting up
[INFO:2016-10-18 02:05:37,082]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: running
[INFO:2016-10-18 02:06:06,848]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: PASS
[INFO:2016-10-18 02:06:06,851]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: tearing down
[INFO:2016-10-18 02:06:40,401]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: Summary: 
[INFO:2016-10-18 02:06:40,403]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:06:40,413]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: test 11 of 16
[INFO:2016-10-18 02:06:40,414]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: setting up
[INFO:2016-10-18 02:07:00,444]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: running
[WARNING - 2016-10-18 02:07:28,216 - verifiable_consumer - _update_global_position - lineno:211]: Expected next consumed offset of 1554, but instead saw 148
[INFO:2016-10-18 02:07:30,908]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: PASS
[INFO:2016-10-18 02:07:30,912]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: tearing down
[INFO:2016-10-18 02:08:03,098]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: Summary: 
[INFO:2016-10-18 02:08:03,100]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:08:03,111]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: test 12 of 16
[INFO:2016-10-18 02:08:03,112]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: setting up
[INFO:2016-10-18 02:08:23,061]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: running
[INFO:2016-10-18 02:08:43,583]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: PASS
[INFO:2016-10-18 02:08:43,588]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: tearing down
[INFO:2016-10-18 02:09:14,114]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: Summary: 
[INFO:2016-10-18 02:09:14,117]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:09:14,127]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: test 13 of 16
[INFO:2016-10-18 02:09:14,128]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: setting up
[INFO:2016-10-18 02:09:34,325]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: running
[INFO:2016-10-18 02:09:54,907]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: PASS
[INFO:2016-10-18 02:09:54,911]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: tearing down
[INFO:2016-10-18 02:10:29,657]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: Summary: 
[INFO:2016-10-18 02:10:29,661]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:10:29,672]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: test 14 of 16
[INFO:2016-10-18 02:10:29,673]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: setting up
[INFO:2016-10-18 02:10:49,985]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: running
[INFO:2016-10-18 02:11:13,637]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: PASS
[INFO:2016-10-18 02:11:13,640]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: tearing down
[INFO:2016-10-18 02:11:46,551]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: Summary: 
[INFO:2016-10-18 02:11:46,553]: SerialTestRunner: kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:11:46,565]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: test 15 of 16
[INFO:2016-10-18 02:11:46,567]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: setting up
[INFO:2016-10-18 02:12:06,890]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: running
[INFO:2016-10-18 02:12:18,578]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: PASS
[INFO:2016-10-18 02:12:18,581]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: tearing down
[INFO:2016-10-18 02:12:49,124]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: Summary: 
[INFO:2016-10-18 02:12:49,126]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor: Data: None
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
[INFO:2016-10-18 02:12:49,138]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: test 16 of 16
[INFO:2016-10-18 02:12:49,140]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: setting up
[INFO:2016-10-18 02:13:09,595]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: running
[INFO:2016-10-18 02:13:21,087]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: PASS
[INFO:2016-10-18 02:13:21,089]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: tearing down
[INFO:2016-10-18 02:13:52,055]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: Summary: 
[INFO:2016-10-18 02:13:52,056]: SerialTestRunner: kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor: Data: None
================================================================================
SESSION REPORT (ALL TESTS)
session_id: 2016-10-18--001
run time:   30 minutes 35.145 seconds
tests run:  16
passed:     16
failed:     0
ignored:    0
================================================================================
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=False
status:     PASS
run time:   1 minute 15.534 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=False.enable_autocommit=True
status:     PASS
run time:   1 minute 17.478 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=False
status:     PASS
run time:   1 minute 3.983 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_failure.clean_shutdown=True.enable_autocommit=True
status:     PASS
run time:   1 minute 8.008 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_broker_rolling_bounce
status:     PASS
run time:   5 minutes 0.117 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=rolling
status:     PASS
run time:   4 minutes 2.763 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=False.bounce_mode=all
status:     PASS
run time:   2 minutes 19.589 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=rolling
status:     PASS
run time:   3 minutes 17.286 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_bounce.clean_shutdown=True.bounce_mode=all
status:     PASS
run time:   2 minutes 35.193 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=False
status:     PASS
run time:   1 minute 23.386 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=False.enable_autocommit=True
status:     PASS
run time:   1 minute 22.684 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=False
status:     PASS
run time:   1 minute 11.003 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_consumer_failure.clean_shutdown=True.enable_autocommit=True
status:     PASS
run time:   1 minute 15.530 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.OffsetValidationTest.test_group_consumption
status:     PASS
run time:   1 minute 16.879 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RoundRobinAssignor
status:     PASS
run time:   1 minute 2.559 seconds
--------------------------------------------------------------------------------
test_id:    2016-10-18--001.kafkatest.tests.client.consumer_test.AssignmentValidationTest.test_valid_assignment.assignment_strategy=org.apache.kafka.clients.consumer.RangeAssignor
status:     PASS
run time:   1 minute 2.917 seconds
--------------------------------------------------------------------------------
Mon Oct 17 19:41:21 PDT 2016
#+end_example


** Running tests
#docker exec kafkadocker_kafka_1 bash -c 'cd /kfk_src; ducktape --cluster-file tests/cluster_file.json tests/kafkatest/sanity_checks/test_kafka_version.py'
#+begin_src bash :results verbatim
docker exec kafkadocker_kafka_1 bash -c 'cd /kfk_src; ducktape --cluster-file tests/cluster_file.json  tests/kafkatest/tests/'
#+end_src

#+RESULTS:

